Ran Plan for dir: `env/stg/devops/ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/bin/terraform plan -input=false -refresh -out "/root/.atlantis/repos/DevOpsTechGroup/search-recommand-terraform/29/default/env/stg/devops/ap-northeast-2/search-recommand-devops-apnortheast2-stg-default.tfplan" -lock=true' in '/root/.atlantis/repos/DevOpsTechGroup/search-recommand-terraform/29/default/env/stg/devops/ap-northeast-2': exit status 1
module.iam.aws_iam_role.custom_role["ecs-auto-scaling-role"]: Refreshing state... [id=ecs-auto-scaling-role]
module.network.aws_vpc.main: Refreshing state... [id=vpc-0f61fb747b68b8f91]
module.iam.aws_iam_role.custom_role["atlantis-terraform-role"]: Refreshing state... [id=atlantis-terraform-role]
module.iam.aws_iam_role.custom_role["ecs-task-role"]: Refreshing state... [id=ecs-task-role]
module.iam.aws_iam_policy.custom_policy["atlantis-terraform-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/atlantis-terraform-role-policy]
module.iam.aws_iam_policy.custom_policy["ecs-task-exec-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/ecs-task-exec-role-policy]
module.iam.aws_iam_policy.custom_policy["ecs-task-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/ecs-task-role-policy]
module.iam.data.aws_iam_policy.managed_policy["ecs-auto-scaling-role-policy"]: Reading...
module.iam.aws_iam_role.custom_role["ecs-task-exec-role"]: Refreshing state... [id=ecs-task-exec-role]
module.network.aws_subnet.private_subnet[2]: Refreshing state... [id=subnet-045bb7283c30f5797]
module.network.aws_route_table.private_route_table: Refreshing state... [id=rtb-030fa6812947c07b4]
module.network.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0181d979eb8c447d8]
module.network.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-04eeffa9848ca7ead]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-03dda805abd5199e4]
module.network.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0407000179e878a57]
module.network.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-00d840bb0c6cafc9d]
module.network.aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-07b528026644bcb89]
module.network.aws_route_table_association.private_route_table_association[0]: Refreshing state... [id=rtbassoc-0c86193303f0585d3]
module.network.aws_route_table_association.private_route_table_association[1]: Refreshing state... [id=rtbassoc-06802b65c4cec8e9c]
module.network.aws_route_table_association.private_route_table_association[2]: Refreshing state... [id=rtbassoc-0131ea150b1ca6a06]
module.iam.data.aws_iam_policy.managed_policy["ecs-auto-scaling-role-policy"]: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole]
module.network.aws_route_table.public_route_table: Refreshing state... [id=rtb-0c573088cdbe95f63]
module.network.aws_route_table_association.public_route_table_association[0]: Refreshing state... [id=rtbassoc-01b69210f9d48ff0d]
module.network.aws_route_table_association.public_route_table_association[1]: Refreshing state... [id=rtbassoc-0c74263a61d62f054]
module.network.aws_route_table_association.public_route_table_association[2]: Refreshing state... [id=rtbassoc-0d8615ab35e950f66]
module.security.aws_security_group.ec2_security_group["elasticsearch-sg"]: Refreshing state... [id=sg-0ea36658394f65021]
module.security.aws_security_group.ec2_security_group["opensearch-sg"]: Refreshing state... [id=sg-0f3e5a0efcdf6d955]
module.security.aws_security_group.ec2_security_group["atlantis-sg"]: Refreshing state... [id=sg-025c1df6fce302fc0]
module.security.aws_security_group.ecs_security_group["opensearch-api-sg"]: Refreshing state... [id=sg-0732c95bc86c4b84a]
module.security.aws_security_group.alb_security_group["search-recommand-alb-sg"]: Refreshing state... [id=sg-029aa161b859482d2]
module.security.aws_security_group.ecs_security_group["elasticsearch-api-sg"]: Refreshing state... [id=sg-08c02a9d108a73faa]
module.iam.aws_iam_role_policy_attachment.role_policy_attachment["atlantis-terraform-role"]: Refreshing state... [id=atlantis-terraform-role-20250410031928661200000004]
module.iam.aws_iam_role_policy_attachment.role_policy_attachment["ecs-auto-scaling-role"]: Refreshing state... [id=ecs-auto-scaling-role-20250410031928629000000001]
module.iam.aws_iam_role_policy_attachment.role_policy_attachment["ecs-task-exec-role"]: Refreshing state... [id=ecs-task-exec-role-20250410031928633400000002]
module.iam.aws_iam_role_policy_attachment.role_policy_attachment["ecs-task-role-attachment"]: Refreshing state... [id=ecs-task-role-20250410031928639400000003]
module.iam.aws_iam_instance_profile.ec2_iam_instance_profile["atlantis-terraform-instance-profile"]: Refreshing state... [id=atlantis-terraform-instance-profile]
module.security.aws_security_group_rule.ecs_egress_security_group["opensearch-api-sg-stg-egress-0-0-0.0.0.0_0-60a4dce1"]: Refreshing state... [id=sgrule-3079265306]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-140.82.112.0_20-e9fc9971"]: Refreshing state... [id=sgrule-482879056]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-39.118.148.0_24-ea346bed"]: Refreshing state... [id=sgrule-1287085654]
module.security.aws_security_group_rule.ecs_egress_security_group["elasticsearch-api-sg-stg-egress-0-0-0.0.0.0_0-f9f4bad0"]: Refreshing state... [id=sgrule-4126786437]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-172.21.0.0_16-ea346bed"]: Refreshing state... [id=sgrule-1665742516]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-185.199.108.0_22-ea346bed"]: Refreshing state... [id=sgrule-570715776]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-39.118.148.0_24-e9fc9971"]: Refreshing state... [id=sgrule-2931989767]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-39.118.148.0_24-91eb1021"]: Refreshing state... [id=sgrule-2897127476]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-39.118.148.0_24-4e245c91"]: Refreshing state... [id=sgrule-3138449062]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-220.75.180.0_24-1df03ba0"]: Refreshing state... [id=sgrule-2637403559]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-192.30.252.0_22-ea346bed"]: Refreshing state... [id=sgrule-1171398354]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-172.21.0.0_16-91eb1021"]: Refreshing state... [id=sgrule-1883416832]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-143.55.64.0_20-e9fc9971"]: Refreshing state... [id=sgrule-2166541542]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-172.21.0.0_16-4e245c91"]: Refreshing state... [id=sgrule-1054809100]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-39.118.148.0_24-1df03ba0"]: Refreshing state... [id=sgrule-616658585]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-220.75.180.0_24-bafbf0d7"]: Refreshing state... [id=sgrule-565978300]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-220.75.180.0_24-91eb1021"]: Refreshing state... [id=sgrule-2726639255]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-172.21.0.0_16-1df03ba0"]: Refreshing state... [id=sgrule-1665991554]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-220.75.180.0_24-1df03ba0"]: Refreshing state... [id=sgrule-720037946]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-172.21.0.0_16-bafbf0d7"]: Refreshing state... [id=sgrule-854165380]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-220.75.180.0_24-ea346bed"]: Refreshing state... [id=sgrule-1117569269]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-192.30.252.0_22-e9fc9971"]: Refreshing state... [id=sgrule-2812796291]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-220.75.180.0_24-e9fc9971"]: Refreshing state... [id=sgrule-2699625380]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-185.199.108.0_22-e9fc9971"]: Refreshing state... [id=sgrule-1049262625]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-39.118.148.0_24-1df03ba0"]: Refreshing state... [id=sgrule-2467826436]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-172.21.0.0_16-1df03ba0"]: Refreshing state... [id=sgrule-692305307]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-172.21.0.0_16-e9fc9971"]: Refreshing state... [id=sgrule-218786881]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-39.118.148.0_24-bafbf0d7"]: Refreshing state... [id=sgrule-798472735]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-220.75.180.0_24-4e245c91"]: Refreshing state... [id=sgrule-3040571397]
module.security.aws_security_group_rule.ec2_egress_security_group["atlantis-sg-stg-egress-0-0-0.0.0.0_0-07b503bf"]: Refreshing state... [id=sgrule-3063956457]
module.security.aws_security_group_rule.alb_security_group_ingress_rule["search-recommand-alb-sg-stg-ingress-443-443-220.75.180.0_24-a52d3dda"]: Refreshing state... [id=sgrule-793350763]
module.security.aws_security_group_rule.ec2_egress_security_group["elasticsearch-sg-stg-egress-0-0-0.0.0.0_0-6a567ae2"]: Refreshing state... [id=sgrule-2979335450]
module.security.aws_security_group_rule.ec2_egress_security_group["opensearch-sg-stg-egress-0-0-0.0.0.0_0-aba5a023"]: Refreshing state... [id=sgrule-496860603]
module.security.aws_security_group_rule.alb_security_group_ingress_rule["search-recommand-alb-sg-stg-ingress-80-80-220.75.180.0_24-0c12137f"]: Refreshing state... [id=sgrule-4185966312]
module.ec2.tls_private_key.ec2_key_pair_rsa["atlantis"]: Refreshing state... [id=a3d1188d5fb16571d028a6b35180719105d1c69e]
module.ec2.local_file.ec2_key_pair_local_file["atlantis"]: Refreshing state... [id=49447db2368b593d2a849e42eedaac367379faca]
module.ec2.aws_key_pair.ec2_key_pair["atlantis"]: Refreshing state... [id=atlantis-ec2-key]
module.ec2.aws_instance.ec2["atlantis"]: Refreshing state... [id=i-0b7e6e771efe3542f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.ec2.data.aws_ami.amazon_ami["atlantis"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "amazon_ami" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "amazon",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "architecture"
          + values = [
              + "x86_64",
            ]
        }
      + filter {
          + name   = "name"
          + values = [
              + "al2023-ami-*-x86_64",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.ec2.local_file.ec2_key_pair_local_file["atlantis"] will be created
  + resource "local_file" "ec2_key_pair_local_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "../../../../modules/aws/compute/ec2/keypair/atlantis-ec2-key.pem"
      + id                   = (known after apply)
    }

  # module.ecr.aws_ecr_repository.ecr_repository["elasticsearch-api"] will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "elasticsearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "elasticsearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "elasticsearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr.aws_ecr_repository.ecr_repository["opensearch-api"] will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "opensearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "opensearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "opensearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecs.data.template_file.container_definitions["elasticsearch-api-td"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "container_definitions" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              %{ for container in jsondecode(containers) }
              {
                "name": "${container.name}-${container.env}",
                "image": "${container.image}-${container.env}:${container.version}",
                "cpu": ${container.cpu},
                "memory": ${container.memory},
                "essential": ${container.essential},
                "portMappings": [
                  %{ if container.port != 0 }
                  {
                    "containerPort": ${container.port},
                    "hostPort": ${container.port},
                    "protocol": "tcp"
                  }
                  %{ endif }
                ],
                "environment": [
                  %{ for env_key, env_value in container.env_variables }
                  {
                    "name": "${env_key}",
                    "value": "${env_value}"
                  }%{ if env_key != keys(container.env_variables)[length(keys(container.env_variables)) - 1] },%{ endif }
                  %{ endfor }
                ],
                "mountPoints": ${jsonencode(container.mount_points)},
                "healthCheck": {
                  "command": ["CMD-SHELL", "${container.health_check.command}"],
                  "interval": ${container.health_check.interval},
                  "timeout": ${container.health_check.timeout},
                  "retries": ${container.health_check.retries}
                }
              }%{ if index(jsondecode(containers), container) < length(jsondecode(containers)) - 1 },%{ endif }
              %{ endfor }
            ]
        EOT
      + vars     = {
          + "containers" = jsonencode(
                [
                  + {
                      + cpu           = 512
                      + env           = "stg"
                      + env_variables = {
                          + SPRING_PROFILES_ACTIVE = "stg"
                          + TZ                     = "Asia/Seoul"
                        }
                      + essential     = true
                      + health_check  = {
                          + command  = "curl --fail http://127.0.0.1:10092/health-check || exit 1"
                          + interval = 30
                          + retries  = 3
                          + timeout  = 10
                        }
                      + image         = "842675972665.dkr.ecr.ap-northeast-2.amazonaws.com/elasticsearch-api"
                      + memory        = 1024
                      + mount_points  = []
                      + name          = "elasticsearch-api"
                      + port          = 10092
                      + version       = "1.0.0"
                    },
                ]
            )
        }
    }

  # module.ecs.data.template_file.container_definitions["opensearch-api-td"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "container_definitions" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              %{ for container in jsondecode(containers) }
              {
                "name": "${container.name}-${container.env}",
                "image": "${container.image}-${container.env}:${container.version}",
                "cpu": ${container.cpu},
                "memory": ${container.memory},
                "essential": ${container.essential},
                "portMappings": [
                  %{ if container.port != 0 }
                  {
                    "containerPort": ${container.port},
                    "hostPort": ${container.port},
                    "protocol": "tcp"
                  }
                  %{ endif }
                ],
                "environment": [
                  %{ for env_key, env_value in container.env_variables }
                  {
                    "name": "${env_key}",
                    "value": "${env_value}"
                  }%{ if env_key != keys(container.env_variables)[length(keys(container.env_variables)) - 1] },%{ endif }
                  %{ endfor }
                ],
                "mountPoints": ${jsonencode(container.mount_points)},
                "healthCheck": {
                  "command": ["CMD-SHELL", "${container.health_check.command}"],
                  "interval": ${container.health_check.interval},
                  "timeout": ${container.health_check.timeout},
                  "retries": ${container.health_check.retries}
                }
              }%{ if index(jsondecode(containers), container) < length(jsondecode(containers)) - 1 },%{ endif }
              %{ endfor }
            ]
        EOT
      + vars     = {
          + "containers" = jsonencode(
                [
                  + {
                      + cpu           = 512
                      + env           = "stg"
                      + env_variables = {
                          + SPRING_PROFILES_ACTIVE = "stg"
                          + TZ                     = "Asia/Seoul"
                        }
                      + essential     = true
                      + health_check  = {
                          + command  = "curl --fail http://127.0.0.1:10091/health-check || exit 1"
                          + interval = 30
                          + retries  = 3
                          + timeout  = 10
                        }
                      + image         = "842675972665.dkr.ecr.ap-northeast-2.amazonaws.com/opensearch-api"
                      + memory        = 1024
                      + mount_points  = []
                      + name          = "opensearch-api"
                      + port          = 10091
                      + version       = "1.0.1"
                    },
                ]
            )
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_policy_scale_out["opensearch-ecs-service"] will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_scale_out" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "ECSOpenSearchScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/search-recommand-ecs-cluster-stg/opensearch-service-stg"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + metric_interval_upper_bound = "10"
              + scaling_adjustment          = 1
            }
          + step_adjustment {
              + metric_interval_lower_bound = "10"
              + metric_interval_upper_bound = "20"
              + scaling_adjustment          = 2
            }
          + step_adjustment {
              + metric_interval_lower_bound = "20"
              + scaling_adjustment          = 3
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target["opensearch-ecs-service"] will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 6
      + min_capacity       = 2
      + resource_id        = "service/search-recommand-ecs-cluster-stg/opensearch-service-stg"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # module.ecs.aws_cloudwatch_metric_alarm.ecs_cpu_scale_out_alert["opensearch-ecs-service"] will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_scale_out_alert" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "ECSOpenSearchScaleOutAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "search-recommand-ecs-cluster-stg"
          + "ServiceName" = "opensearch-ecs-service-stg"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"      = "ECSOpenSearchScaleOutAlarm-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                              = {
          + "Name"      = "ECSOpenSearchScaleOutAlarm-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster["search-recommand-ecs-cluster"] will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "search-recommand-ecs-cluster-stg"
      + tags     = {
          + "Name"      = "search-recommand-ecs-cluster-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all = {
          + "Name"      = "search-recommand-ecs-cluster-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs_service["elasticsearch-ecs-service"] will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "search-recommand-ecs-cluster-stg"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 250
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "elasticsearch-ecs-service-stg"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"      = "elasticsearch-ecs-service-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "elasticsearch-ecs-service-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "elasticsearch-api-stg"
          + container_port   = 10092
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-08c02a9d108a73faa",
            ]
          + subnets          = [
              + "subnet-0181d979eb8c447d8",
              + "subnet-045bb7283c30f5797",
              + "subnet-04eeffa9848ca7ead",
            ]
        }
    }

  # module.ecs.aws_ecs_service.ecs_service["opensearch-ecs-service"] will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "search-recommand-ecs-cluster-stg"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 250
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "opensearch-ecs-service-stg"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"      = "opensearch-ecs-service-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "opensearch-ecs-service-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "opensearch-api-stg"
          + container_port   = 10091
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0732c95bc86c4b84a",
            ]
          + subnets          = [
              + "subnet-0181d979eb8c447d8",
              + "subnet-045bb7283c30f5797",
              + "subnet-04eeffa9848ca7ead",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition["elasticsearch-api-td"] will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::842675972665:role/ecs-task-exec-role"
      + family                   = "elasticsearch-api-td-stg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"      = "elasticsearch-api-td-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                 = {
          + "Name"      = "elasticsearch-api-td-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_role_arn            = "arn:aws:iam::842675972665:role/ecs-task-role"
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "core-shared-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition["opensearch-api-td"] will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::842675972665:role/ecs-task-exec-role"
      + family                   = "opensearch-api-td-stg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"      = "opensearch-api-td-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                 = {
          + "Name"      = "opensearch-api-td-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_role_arn            = "arn:aws:iam::842675972665:role/ecs-task-role"
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "core-shared-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # module.elb.aws_lb.alb["search-recommand-alb"] will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 300
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "search-recommand-alb-stg"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-029aa161b859482d2",
        ]
      + subnets                                                      = [
          + "subnet-00d840bb0c6cafc9d",
          + "subnet-0407000179e878a57",
          + "subnet-07b528026644bcb89",
        ]
      + tags                                                         = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                     = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.elb.aws_lb_listener.alb_listener["alb-http-listener"] will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"      = "alb-http-listener-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                              = {
          + "Name"      = "alb-http-listener-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["elasticsearch-alb-http-listener-rule"] will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 2
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/elasticsearchPlaylistSearch",
                ]
            }
        }
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["opensearch-alb-http-listener-rule"] will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/vectorPlaylistSearch",
                ]
            }
        }
    }

  # module.elb.aws_lb_target_group.target_group["elasticsearch-alb-tg"] will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "elasticsearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10092
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "elasticsearch-alb-tg-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "elasticsearch-alb-tg-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f61fb747b68b8f91"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10092"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.elb.aws_lb_target_group.target_group["opensearch-alb-tg"] will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "opensearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10091
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "opensearch-alb-tg-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "opensearch-alb-tg-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f61fb747b68b8f91"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10091"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.iam.aws_iam_policy.custom_policy["atlantis-terraform-role-policy"] will be updated in-place
  ~ resource "aws_iam_policy" "custom_policy" {
        id               = "arn:aws:iam::842675972665:policy/atlantis-terraform-role-policy"
        name             = "atlantis-terraform-role-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "ec2:*",
                          - "iam:*",
                          + "iam:GetRole",
                            "iam:PassRole",
                            # (7 unchanged elements hidden)
                            "ecs:*",
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DescribeTable",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Name"      = "atlantis-terraform-role-policy-stg"
            "createdBy" = "ymkim1085@funin.camp"
            "env"       = "stg"
            "managedBy" = "terraform-admin"
            "project"   = "search-recommand"
            "service"   = "search-recommand"
            "teamTag"   = "devops"
        }
        # (7 unchanged attributes hidden)
    }

  # module.storage.aws_dynamodb_table.terraform_state_lock["search-recommand-tfstate-lock"] will be created
  + resource "aws_dynamodb_table" "terraform_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "search-recommand-tfstate-lock-stg"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"      = "search-recommand-tfstate-lock-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all         = {
          + "Name"      = "search-recommand-tfstate-lock-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.storage.aws_s3_bucket.s3["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket" "s3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "search-recommand-tfstate-stg"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "search-recommand-tfstate-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                    = {
          + "Name"      = "search-recommand-tfstate-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_public_access_block.public_access_block["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.storage.aws_s3_bucket_server_side_encryption_configuration.server_side_encrypt["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "server_side_encrypt" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_versioning.versioning["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 22 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_ec2            = (sensitive value)
  + debug_ecs_module     = (sensitive value)
╷
│ Error: Invalid function argument
│ 
│   on ../../../../modules/aws/compute/ec2/main.tf line 51, in resource "aws_instance" "ec2":
│   51:   ) ? file("${path.module}/script/${each.value.script_file_name}") : null
│     ├────────────────
│     │ while calling file(path)
│     │ each.value.script_file_name is "install_atlantis.sh"
│     │ path.module is "../../../../modules/aws/compute/ec2"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "../../../../modules/aws/compute/ec2/script/install_atlantis.sh"; this
│ function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵

```
</details>